(Цветно принтиране) Напишете shell script color_print, който взима два параметъра.

Първият може да е измежду "-r", "-g" "-b", а вторият е произволен string.
На командата "echo" може да се подаде код на цвят, който ще оцвети текста в определения цвят.
В зависимост от първия аргумент, изпринтете втория аргумен в определения цвят:

"-r" е червено. Кодът на червеното е '\033[0;31m' (echo -e "\033[0;31m This is red")
"-g" е зелено. Кодът на зеленото е '\033[0;32m' (echo -e "\033[0;32m This is green")
"-b" е синьо. Кодът на синьото е '\033[0;34m' (echo -e "\033[0;34m This is blue")
Ако е подадена друга буква изпишете "Unknown colour", а ако изобщо не е подаден аргумент за цвят, просто изпишете текста.

Hint:

В края на скрипта си напишете:
echo -e '\033[0m'
,за да не се прецакат цветовете на терминала. Това е цветът на "няма цвят".


  1 #!/bin/bash
  2
  3 if [ $# -ne 2 ]; then
  4     exit 1
  5 fi
  6
  7 first=$1
  8 sec=$2
  9
 10
 11 if [ "$first" == "-r" ]; then
 12     echo -e "\033[0;31m$sec This is red"
 13 elif [ "$first" == "-g" ]; then
 14     echo -e "\033[0;32m$sec This is green"
 15 elif [ "$first" == "-b" ]; then
 16     echo -e "\033[0;34m$sec This is blue"
 17 else
 18     echo "$sec"
 19     echo "unknown color"
 20 fi
 21
 22 echo -e '\033[0m'
