Напишете скрипт, който получава задължителен първи позиционен параметър – 
директория и незадължителен втори – число. Скриптът трябва да проверява
подадената директория и нейните под-директории и да извежда имената на:
а) при подаден на скрипта втори параметър – всички файлове с брой
hardlink-ове поне равен на
параметъра;
б) при липса на втори параметър – всички symlink-ове с несъществуващ 
destination (счупени symlinkове).
Забележка:За удобство приемаме, че ако има подаден втори параметър, то той е число.

#!/bin/bash

if [[ $# -lt 1 || $# -gt 2 ]]; then
  exit 1;
fi

dir="${1}";
if [[ ! -d "$dir" ]];then
  exit 2;
fi

if [[ $# -eq 2 ]];then
  num="${2}"
  find "$dir" -type f -links +"(($num-1))" //because -links + N means more than N and not at least N
else
  find "$dir" -type l ! -exec test -e {} \; -print
fi


