В текущата директория има само обикновени файлове (без директории). Да се напише
bash script, който приема 2 позиционни параметъра – числа, който мести файловете от текущата директория към нови директории (a, b и c, които трябва да бъдат създадени), като определен файл се
мести към директория ’a’, само ако той има по-малко редове от първи позиционен параметър, мести
към директория ’b’, ако редове са между първи и втори позиционен параметър и в ’c’ в останалите
случаи.

#!/bin/bash

if [[ $# -ne 2 ]];then
  echo "2 parameters needed"
  exit 1;
fi

  mkdir -p ./a ./b ./c           #or mkdir -p a b c


for file in *; do
lines=$(cat "$file" | wc -l);
 if [[ "$lines" -lt $1 ]]; then
   mv "$file" a/  
  elif [[ "$lines" -ge $1 && "$lines" -le $2 ]];then
    mv "$file" b/
  else
    mv "$file" c/
fi
done

