#В текущата директория има само обикновени файлове (без директории).Да се
#напише bash script, който приема 2 позиционни параметъра – числа,
който мести файловете от
#текущата директория към нови директории (a, b и c, които трябва да бъдат създадени), 
като
#определен файл се мести към директория ’a’, само ако той има по-малко
редове от първи позиционен
#параметър, мести към директория ’b’, ако редове са между първи и втори
позиционен параметър
#и в ’c’ в останалите случаи.

#/bin/bash

if [[ $# -ne 2 ]]; then
  exit 1;
fi

first=$1
sec=$2

mkdir -p "a" "b" "c"

for files in *; do
  if [[ -f "$files" ]]; then
    lines=$( cat "$files" | wc -l )
    if (( lines < first )); then
      mv "$files" a/
    elif (( lines >= first && lines <= sec )); then
      mv "$files" b/
    else
      mv "$files" c/
    fi
  fi
fi
done


